Revit 2026 API

# LoadCombinationGetCaseAndCombinationIds Method

---

Returns collection of the load combination case and combination IDs.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetCaseAndCombinationIds()
```
```vb
Public Function GetCaseAndCombinationIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetCaseAndCombinationIds()
```
```fsharp
member GetCaseAndCombinationIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId A collection of the load combination case and combination IDs.

Load combination components could be load cases or other load combinations. To set them with factors use [M:Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Structure.LoadComponent})] method.

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace